DeviceProcessEvents
| where tolower(FileName) == "micrun.exe"
    or tolower(ProcessCommandLine) has "micrun.exe"
| project //Dictates the columns that will be displayed by the query.
    TimeGenerated,
    ActionType,
    DeviceName,
    AccountName,
    AccountUpn,
    InitiatingProcessFileName,
    ProcessCommandLine,
    FileName,
    SHA1,
    FolderPath
| sort by TimeGenerated desc //Sorts by showing the most recent events first. 